[M_WinterIsComing MissionDefinition]
MissionName="Winter is here and the milk is flowing."
MissionDescription="Casting wants you to save an evil king named Joffrey. But "warning" here does not mean "killing". rolling wants us to find Joffrey, kill his guards and defeat him before he can.."
TurnInDescription="The night was dark and full of turtles.."
MissionSummary="Find Prince Geoffrey and stop him from acting like a dog.."
MissionGiver="Roland"
MissionTurnInLocation="Roland"
TeaserText="I know all this...."

[M_WinterIsComing:WIC_DefeatJeffery MissionObjectiveDefinition]
ProgressMessage="Jeffrey lost"

[M_WinterIsComing:WIC_FindJeffery MissionObjectiveDefinition]
ProgressMessage="Please send this to Jeffrey"

[M_WinterIsComing:WIC_KillJefferysGuards MissionObjectiveDefinition]
ProgressMessage="Kill Jeffrey's guard."

[M_WinterIsComing:WIC_KillNamed1 MissionObjectiveDefinition]
ProgressMessage="from the wall"

[M_WinterIsComing:WIC_KillNamed2 MissionObjectiveDefinition]
ProgressMessage="To kill the mill."

[M_WinterIsComing:WIC_OBJ_TalkToAristocrat MissionObjectiveDefinition]
ProgressMessage=""

[M_WinterIsComing:WIC_OS_DefeatJeffery MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_GoBackToTown MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_GotoCastle MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_KillFirstGuards MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_KillGuards MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_Slap1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_Slap2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_Slap3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_OS_TalkToAristocrat MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Rolfland asks you to beware of an evil prince named Geoffrey. Actually, "care" doesn't mean "kill" in this case - Roland just wants you to find Jeffrey, kill his guards, and beat him to death with a chicken. don't get rid of it.<br>You defeated Jeffrey a few times, but you were able to kill him each time.."

[M_WinterIsComing:WIC_OS_TURNIN MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WinterIsComing:WIC_ReturnToClaptrap MissionObjectiveDefinition]
ProgressMessage="Return to the village"

[M_WinterIsComing:WIC_Slap MissionObjectiveDefinition]
ProgressMessage="Jeffrey laughed."

[M_WinterIsComing:WIC_SlapAgain MissionObjectiveDefinition]
ProgressMessage="Geoffrey clicked again"

[M_WinterIsComing:WIC_SlapYetAgain MissionObjectiveDefinition]
ProgressMessage="He hit Jeffrey again."

